In [3]:
import os
import pandas as pd
import numpy as np

 ###  1.	Create a program that asks the user to enter their name and their age. Print out a message that tells them the year that they will turn 100 years old

In [5]:
import datetime
Name = input("Enter your name: ")
Age = int(input("Enter your age: "))
print(Name+" will turn 100 in " +str(datetime.datetime.today().year - Age + 100))  #Googled this one

Enter your name: Jack
Enter your age: 25
Jack will turn 100 in 2097

### 2.	What is pandas groupby? Demonstrate with your own example

In [57]:
dic1 = {'Name':['Jackson', 'Joshua', 'Jack','Sunil','Chethri','Bose'],
        'Age':[27, 24, 22,27,24,22],
        'City':['Chennai', 'Mumbai', 'Bangalore','Chennai', 'Mumbai', 'Bangalore'] }
df = pd.DataFrame(dic1)  
print(df)

      Name  Age       City
0  Jackson   27    Chennai
1   Joshua   24     Mumbai
2     Jack   22  Bangalore
3    Sunil   27    Chennai
4  Chethri   24     Mumbai
5     Bose   22  Bangalore

In [63]:
df['Score'] = [70,70,80,88,90,95]

In [66]:
df.groupby(['Age'])['Score'].sum()

Age
22    175
24    160
27    158
Name: Score, dtype: int64

In [65]:
df.groupby(['Age'])['Score'].count()

Age
22    2
24    2
27    2
Name: Score, dtype: int64

# 3.	How to create a dataframe from list?

In [19]:
list1 = ['Jackson', 'Joshua', 'Jack','Sunil','Chethri','Bose']
df = pd.DataFrame(list1, index =['1', '2', '3', '4', '5', '6'],
                                              columns =['Names'])
df

     Names
1  Jackson
2   Joshua
3     Jack
4    Sunil
5  Chethri
6     Bose

### 4.	What are the ways to combine the dataframe in pandas. Give an example for each

In [25]:
a = pd.DataFrame( {"NAME": ['Jackson', 'Joshua', 'Jack','Sunil'],"AGE": [27, 24, 22, 27] }, index=[0, 1, 2, 3])

In [26]:
b = pd.DataFrame( {"NAME": ['AAROn', 'FInch', 'PHilips','Phelps'],"AGE": [27, 25, 22, 27] }, index=[4, 5, 6, 7])

In [32]:
pd.concat([a, b], axis=1)

      NAME   AGE     NAME   AGE
0  Jackson  27.0      NaN   NaN
1   Joshua  24.0      NaN   NaN
2     Jack  22.0      NaN   NaN
3    Sunil  27.0      NaN   NaN
4      NaN   NaN    AAROn  27.0
5      NaN   NaN    FInch  25.0
6      NaN   NaN  PHilips  22.0
7      NaN   NaN   Phelps  27.0

In [29]:
pd.concat([a, b], axis=0)

      NAME  AGE
0  Jackson   27
1   Joshua   24
2     Jack   22
3    Sunil   27
4    AAROn   27
5    FInch   25
6  PHilips   22
7   Phelps   27

In [30]:
a.append(b, ignore_index = True)

      NAME  AGE
0  Jackson   27
1   Joshua   24
2     Jack   22
3    Sunil   27
4    AAROn   27
5    FInch   25
6  PHilips   22
7   Phelps   27

In [31]:
a.merge(b, on='AGE', how = 'left')

    NAME_x  AGE   NAME_y
0  Jackson   27    AAROn
1  Jackson   27   Phelps
2   Joshua   24      NaN
3     Jack   22  PHilips
4    Sunil   27    AAROn
5    Sunil   27   Phelps

### 5.	What is the difference between list and tuples in Python?

In [33]:
list1=[1,2,3,4,5,6,7,7]

In [34]:
list1[2]=20

In [35]:
list1

[1, 2, 20, 4, 5, 6, 7, 7]

In [36]:
a =list1

In [38]:
tupl1 = tuple(a)

In [39]:
tupl1[2]=20

TypeError: 'tuple' object does not support item assignment

### 6.	Find out the mean, median and standard deviation of this numpy array -> np.array([1,5,3,100,4,48])

In [67]:
a =np.array([1,5,3,100,4,48])
mean =print(np.mean(a,axis=0))
median = print(np.median(a,axis=0))
std = print(np.std(a,axis=0))

26.833333333333332
4.5
36.59424666377065

## 7.	How will you remove duplicate elements from a list?

In [42]:
test = [1, 3, 5, 6, 3, 5, 6, 1]

In [43]:
set(test)

{1, 3, 5, 6}

### 8.	What is a map() function in Python? Give an example

In [44]:
test = [1, 3, 5, 6, 3, 5, 6, 1]

new_list = list(map(lambda x: x%2, test))
print(new_list)

[1, 1, 1, 0, 1, 1, 0, 1]

In [45]:
test = list(map(lambda x : x.upper(), ['Jackson', 'Joshua', 'Jack']))
print(test)

['JACKSON', 'JOSHUA', 'JACK']

###  9.	What is pass in Python?

In [48]:
for i in range(1,8):
    print (i)
    if (i == 5):
        break

1
2
3
4
5

In [49]:
for i in range(1,8):
    print (i)
    if (i == 5):
        pass

1
2
3
4
5
6
7

### 10.	What is vstack() in numpy? Give an example

In [50]:
a = np.array([[1,2,3],[4,5,6]])
b = np.array([[7,8,9],[10,11,12]])

In [51]:
np.vstack((a,b))  #concatenate row wise.

array([[ 1,  2,  3],
       [ 4,  5,  6],
       [ 7,  8,  9],
       [10, 11, 12]])